tap "aviator-co/tap"
tap "ejoffe/tap"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jimeh/emacs-builds"
tap "mistertea/et"
tap "nodenv/nodenv"
tap "railwaycat/emacsmacport"
tap "withgraphite/tap"
# Library for manipulating PNG images
brew "libpng"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Format bazel BUILD files with a standard convention
brew "buildifier"
# Software library to render fonts
brew "freetype"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Reimplementation of ctags(1)
brew "ctags"
# C library implementing the SSH2 protocol
brew "libssh2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Isolated development environments using Docker
brew "docker-compose"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# GitHub command-line tool
brew "gh"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Automatic git commit --fixup
brew "git-absorb"
# High-velocity, monorepo-scale workflow for Git
brew "git-branchless"
# Git extension for versioning large files
brew "git-lfs"
# GitHub Model Context Protocol server for AI tools
brew "github-mcp-server"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Cross-platform application and UI framework
brew "qt"
# Command-driven, interactive function plotting
brew "gnuplot"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Apply a diff file to an original
brew "gpatch"
# Library access to GnuPG
brew "gpgme"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Add GitHub support to git on the command-line
brew "hub"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Manage your Java environment
brew "jenv"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Portable Foreign Function Interface library
brew "libffi"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# GNOME XML library
brew "libxml2"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Minimalist GNU for Windows and GCC cross-compilers
brew "mingw-w64"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# QUIC transport protocol implementation
brew "mvfst"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Install NodeJS versions
brew "node-build"
# Node.js version manager
brew "nodenv"
# Development kit for the Java programming language
brew "openjdk@21"
# Open source distributed and RESTful search engine
brew "opensearch"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python dependency management tool
brew "pipenv"
# Optimizer for PNG files
brew "pngcrush"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Python version management
brew "pyenv"
# Migrate pip packages from one Python version to another
brew "pyenv-pip-migrate"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Cross-platform application and UI framework
brew "qt@5"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Auto-installs gems for Ruby installs
brew "rbenv-default-gems"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Source control client
brew "sapling"
# Version control system designed to be a better CVS
brew "subversion"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# User interface to the TELNET protocol
brew "telnet"
# Linter for Terraform files
brew "tflint"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Markup-based typesetting system
brew "typst"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
brew "aviator-co/tap/av"
# Packer
brew "hashicorp/tap/packer"
# Fix IntelliJ/WebStorm's npm integration under nodenv
brew "nodenv/nodenv/jetbrains-npm"
# Install a set of npm packages every time you install a new version of Node
brew "nodenv/nodenv/nodenv-default-packages"
# Migrate npm packages from one Node version to another
brew "nodenv/nodenv/nodenv-npm-migrate"
# Automatically runs `nodenv rehash`
brew "nodenv/nodenv/nodenv-package-rehash"
# Update nodenv and installed plugins
brew "nodenv/nodenv/nodenv-update"
# Allows you to manage your stacked changes and submit them for review on GitHub
brew "withgraphite/tap/graphite"
# Command-line interface for 1Password
cask "1password-cli"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Application launcher and productivity software
cask "alfred"
# Display management tool
cask "betterdisplay"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Write, edit, and chat about your code with AI
cask "cursor"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Developer platform
cask "dotnet-sdk"
# Client for the Dropbox cloud storage service
cask "dropbox"
# GNU Emacs text editor
cask "emacs-app"
# Web browser
cask "firefox"
cask "font-anonymice-powerline"
cask "font-consolas-for-powerline"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-fira-mono-for-powerline"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-g-for-powerline"
cask "font-iosevka"
cask "font-iosevka-aile"
cask "font-liberation-mono-for-powerline"
cask "font-menlo-for-powerline"
cask "font-meslo-for-powerline"
cask "font-monofur-for-powerline"
cask "font-noto-mono-for-powerline"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "font-ubuntu-mono-derivative-powerline"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Desktop client for GitHub repositories
cask "github"
# Client for the Google Drive storage service
cask "google-drive"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Open-source keystroke visualiser
cask "keycastr"
# Free and open-source painting and sketching program
cask "krita"
# Software for Logitech devices
cask "logi-options+"
# Screen and video recording software
cask "loom"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Multi-platform web browser
cask "microsoft-edge"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Minimal installer for conda
cask "miniconda"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# StrongDM client
cask "sdm"
# Command-line client for connecting to Snowflake
cask "snowflake-snowsql"
# Music streaming service
cask "spotify"
# Text editor for code, markup and prose
cask "sublime-text"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@11"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@25"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@8"
# Management tool for Unity
cask "unity-hub"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onelight"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "bazelbuild.vscode-bazel"
vscode "belfz.search-crates-io"
vscode "bung87.vscode-gemfile"
vscode "cameron.vscode-pytest"
vscode "chrischinchilla.vscode-pandoc"
vscode "codezombiech.gitignore"
vscode "dawhite.mustache"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "doublefint.pgsql"
vscode "dracula-theme.theme-dracula"
vscode "drblury.protobuf-vsc"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "emilast.logfilehighlighter"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.dotnet-test-explorer"
vscode "franneck94.c-cpp-runner"
vscode "gaborv.flatbuffers"
vscode "gamunu.vscode-yarn"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "goessner.mdmath"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "ionide.ionide-fake"
vscode "ionide.ionide-fsharp"
vscode "ionide.ionide-paket"
vscode "james-yu.latex-workshop"
vscode "jasonnutter.vscode-codeowners"
vscode "johnpapa.vscode-peacock"
vscode "koichisasada.vscode-rdbg"
vscode "krizzdewizz.refactorix"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "meta.sapling-scm"
vscode "metaseed.metago"
vscode "metaseed.metajump"
vscode "metaseed.metaword"
vscode "mhutchie.git-graph"
vscode "mrcrowl.hg"
vscode "mrmlnc.vscode-less"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.theme-tomorrowkit"
vscode "ms-vscode.wordcount"
vscode "ms-vsliveshare.vsliveshare"
vscode "nvarner.typst-lsp"
vscode "orta.vscode-jest"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "rogalmic.bash-debug"
vscode "rust-lang.rust-analyzer"
vscode "searking.preview-vscode"
vscode "shakram02.bash-beautify"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sleistner.vscode-fileutils"
vscode "sorbet.sorbet-vscode-extension"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "techer.open-in-browser"
vscode "tomoki1207.pdf"
vscode "tootone.org-mode"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
vscode "webfreak.debug"
vscode "wmaurer.change-case"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
