tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/science"
tap "homebrew/services"
tap "mistertea/et"
cask "java"
brew "bash"
brew "cmake"
brew "coreutils"
brew "curl", args: ["with-gssapi", "with-openssl"]
brew "git"
brew "openssl"
brew "sqlite"
brew "glances"
brew "gnuplot"
brew "graphviz"
brew "imagemagick"
brew "mas"
brew "maven"
brew "mercurial"
brew "python"
brew "mosh"
brew "node"
brew "pandoc"
brew "postgresql", restart_service: true
brew "rbenv"
brew "ruby-build"
brew "telnet"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
brew "zsh"
brew "heroku/brew/heroku"
brew "mistertea/et/et"
cask "adobe-acrobat-reader"
cask "alfred"
cask "anaconda"
cask "android-studio"
cask "dash"
cask "dotnet-sdk"
cask "emacs"
cask "firefox"
cask "flash-player"
cask "font-anonymice-powerline"
cask "font-consolas-for-powerline"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-fira-mono-for-powerline"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-g-for-powerline"
cask "font-liberation-mono-for-powerline"
cask "font-menlo-for-powerline"
cask "font-meslo-for-powerline"
cask "font-monofur-for-powerline"
cask "font-noto-mono-for-powerline"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "font-ubuntu-mono-derivative-powerline"
cask "free-download-manager"
cask "google-backup-and-sync"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keka"
cask "krita"
cask "mactex"
cask "malwarebytes"
cask "mono-mdk"
cask "powershell"
cask "scroll-reverser"
cask "skype"
cask "soda-player"
cask "spectacle"
cask "spotify"
cask "sublime-text"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio"
cask "visual-studio-code"
mas "Amphetamine", id: 937984704
mas "CopyClip", id: 595191960
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "Wunderlist", id: 410628904
mas "Xcode", id: 497799835
