aaron-bond.better-comments
akamud.vscode-theme-onelight
alefragnani.Bookmarks
alefragnani.project-manager
belfz.search-crates-io
bung87.vscode-gemfile
bungcip.better-toml
Cameron.vscode-pytest
ChrisChinchilla.vscode-pandoc
codezombiech.gitignore
dbaeumer.vscode-eslint
deerawan.vscode-dash
DotJoshJohnson.xml
dracula-theme.theme-dracula
eamodio.gitlens
ecmel.vscode-html-css
EditorConfig.EditorConfig
emilast.LogFileHighlighter
emmanuelbeziat.vscode-great-icons
Equinusocio.vsc-community-material-theme
Equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons
esbenp.prettier-vscode
firefox-devtools.vscode-firefox-debug
fknop.vscode-npm
flowtype.flow-for-vscode
formulahendry.auto-close-tag
formulahendry.auto-complete-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
formulahendry.dotnet-test-explorer
franneck94.c-cpp-runner
gamunu.vscode-yarn
GitHub.remotehub
GitHub.vscode-pull-request-github
goessner.mdmath
googlecloudtools.cloudcode
humao.rest-client
IBM.output-colorizer
Ionide.Ionide-FAKE
Ionide.Ionide-fsharp
Ionide.Ionide-Paket
James-Yu.latex-workshop
johnpapa.vscode-peacock
krizzdewizz.refactorix
llvm-vs-code-extensions.vscode-clangd
mads-hartmann.bash-ide-vscode
mechatroner.rainbow-csv
meta.sapling-scm
metaseed.metago
metaseed.MetaJump
metaseed.MetaWord
mhutchie.git-graph
mrcrowl.hg
mrmlnc.vscode-scss
ms-azuretools.azure-dev
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-azurevirtualmachines
ms-azuretools.vscode-docker
MS-CST-E.vscode-devskim
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.black-formatter
ms-python.flake8
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azure-account
ms-vscode.azure-repos
ms-vscode.azurecli
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.makefile-tools
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vscode.Theme-TomorrowKit
ms-vscode.wordcount
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-pack
nvarner.typst-lsp
Orta.vscode-jest
pflannery.vscode-versionlens
PKief.material-icon-theme
redhat.java
REditorSupport.r
rogalmic.bash-debug
rust-lang.rust-analyzer
searKing.preview-vscode
serayuzgur.crates
shakram02.bash-beautify
sleistner.vscode-fileutils
streetsidesoftware.code-spell-checker
stylelint.vscode-stylelint
techer.open-in-browser
tintoy.msbuild-project-tools
tomoki1207.pdf
tootone.org-mode
twxs.cmake
vadimcn.vscode-lldb
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
wayou.vscode-todo-highlight
webfreak.debug
wingrunr21.vscode-ruby
wmaurer.change-case
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
zxh404.vscode-proto3
