IBM.output-colorizer
aaron-bond.better-comments
akamud.vscode-theme-onelight
alefragnani.Bookmarks
alefragnani.project-manager
azemoh.one-monokai
belfz.search-crates-io
bung87.vscode-gemfile
bungcip.better-toml
castwide.solargraph
codezombiech.gitignore
CoenraadS.bracket-pair-colorizer-2
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
deerawan.vscode-dash
docsmsft.docs-markdown
donjayamanne.githistory
DotJoshJohnson.xml
dracula-theme.theme-dracula
eamodio.gitlens
ecmel.vscode-html-css
EditorConfig.EditorConfig
emilast.LogFileHighlighter
emmanuelbeziat.vscode-great-icons
esbenp.prettier-vscode
fknop.vscode-npm
flowtype.flow-for-vscode
formulahendry.auto-close-tag
formulahendry.auto-complete-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
formulahendry.dotnet-test-explorer
gamunu.vscode-yarn
GitHub.vscode-pull-request-github
glen-84.sass-lint
goessner.mdmath
Gruntfuggly.todo-tree
humao.rest-client
Ionide.Ionide-FAKE
Ionide.Ionide-fsharp
Ionide.Ionide-Paket
James-Yu.latex-workshop
jchannon.csharpextensions
jmrog.vscode-nuget-package-manager
johnpapa.vscode-peacock
k--kato.docomment
karigari.chat
krizzdewizz.refactorix
Leopotam.csharpfixformat
mads-hartmann.bash-ide-vscode
matklad.rust-analyzer
mattn.Lisp
mechatroner.rainbow-csv
metaseed.metago
mhutchie.git-graph
misogi.ruby-rubocop
mrcrowl.hg
mrmlnc.vscode-scss
ms-azuretools.vscode-docker
MS-CST-E.vscode-devskim
ms-dotnettools.csharp
ms-python.python
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-ssh-explorer
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.Theme-TomorrowKit
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.powershell
ms-vscode.vscode-typescript-tslint-plugin
ms-vscode.wordcount
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-audio
ms-vsliveshare.vsliveshare-pack
msjsdiag.debugger-for-chrome
Orta.vscode-jest
paolodellepiane.fantomas-fmt
rebornix.ruby
redhat.java
robinbentley.sass-indented
rogalmic.bash-debug
rust-lang.rust
searKing.preview-vscode
serayuzgur.crates
shakram02.bash-beautify
Shan.code-settings-sync
sleistner.vscode-fileutils
streetsidesoftware.code-spell-checker
techer.open-in-browser
tintoy.msbuild-project-tools
twxs.cmake
vadimcn.vscode-lldb
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
wayou.vscode-todo-highlight
wingrunr21.vscode-ruby
wmaurer.change-case
xabikos.JavaScriptSnippets
xaver.clang-format
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
ziyasal.vscode-open-in-github
