IBM.output-colorizer
MS-DevSkim.vscode-devskim
aaron-bond.better-comments
akamud.vscode-theme-onelight
alefragnani.Bookmarks
alefragnani.project-manager
azemoh.one-monokai
bung87.vscode-gemfile
bungcip.better-toml
castwide.solargraph
codezombiech.gitignore
CoenraadS.bracket-pair-colorizer
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
deerawan.vscode-dash
docsmsft.docs-markdown
donjayamanne.githistory
DotJoshJohnson.xml
dracula-theme.theme-dracula
eamodio.gitlens
ecmel.vscode-html-css
EditorConfig.EditorConfig
eg2.tslint
emilast.LogFileHighlighter
emmanuelbeziat.vscode-great-icons
esbenp.prettier-vscode
fknop.vscode-npm
flowtype.flow-for-vscode
formulahendry.auto-close-tag
formulahendry.auto-complete-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
formulahendry.dotnet-test-explorer
gamunu.vscode-yarn
GitHub.vscode-pull-request-github
glen-84.sass-lint
Gruntfuggly.todo-tree
humao.rest-client
Ionide.Ionide-fsharp
James-Yu.latex-workshop
jchannon.csharpextensions
jmrog.vscode-nuget-package-manager
k--kato.docomment
KnisterPeter.vscode-github
krizzdewizz.refactorix
mads-hartmann.bash-ide-vscode
mattn.Lisp
mechatroner.rainbow-csv
metaseed.metago
misogi.ruby-rubocop
mrcrowl.hg
ms-python.python
ms-vscode.Theme-TomorrowKit
ms-vscode.cpptools
ms-vscode.csharp
ms-vscode.PowerShell
ms-vscode.wordcount
msjsdiag.debugger-for-chrome
PeterJausovec.vscode-docker
pflannery.vscode-versionlens
rebornix.ruby
redhat.java
robertohuertasm.vscode-icons
robinbentley.sass-indented
rogalmic.bash-debug
rust-lang.rust
searKing.preview-vscode
serayuzgur.crates
shakram02.bash-beautify
Shan.code-settings-sync
sjhuangx.vscode-scheme
sleistner.vscode-fileutils
streetsidesoftware.code-spell-checker
techer.open-in-browser
tintoy.msbuild-project-tools
twxs.cmake
vadimcn.vscode-lldb
vector-of-bool.cmake-tools
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-test
vscjava.vscode-maven
wmaurer.change-case
xabikos.JavaScriptSnippets
yzhang.markdown-all-in-one
zhuangtongfa.Material-theme
